# gb-control-work

Контрольная Работа Geek Brains

## Задача

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Решение

Для начала создаем масив со строковыми данными.Я выбрал вариант "Задать массив на старте выполнения алгоритма"

```c#
string[] initArray = ["Hello", "2", "world", ":-)"];
```

Создадим фунцкию "filterArray" которая будет прнимать в себя строковый массив, и на выходе так же будет возвращать новый строковый массив: Создаем List чтоб в дальнейшем поместить его результат в массив;

```c#
static string[] filterArray(string[] array){
    List<string> output = [];

    return [.. output];
}
```

Данный синтакс означает что мы распределяем (спредим) каждый елемент List в массив;

```c#
return [.. output];
```

Теперь пробежимся по каждому элементу массива с помошью цикла "for"

```c#
static string[] filterArray(string[] array){
    List<string> output = [];
    for (int i = 0; i < array.Length; i++){

    }
    return [.. output];
}
```

В цикле нам нужно проверить если длина строки элемента массива меньше либо равна 3, то помещаем его в новый массив output

```c#
static string[] filterArray(string[] array){
    List<string> output = [];
    for (int i = 0; i < array.Length; i++){
        if (array[i].Length <= 3){
            output.Add(array[i]);
        }
    }
    return [.. output];
}
```

Осталось только красиво отобразить результат. Для этого создадим новую функцию "printArrayResult" которая просто будет отображать результат красиво в консоле.

```c#
static void printArrayResult(string[] array)
{
    Console.WriteLine("[" + string.Join(", ", array) + "]");
}
```

Теперь создаем переменную result в которую будет прописан отфильтрованный массив, и печатаем ее с помощью printArrayResult

```c#
string[] result = filterArray(initArray);
printArrayResult(result);
```

Результатом в данном случае будет

```bash
[2, :-)]
```

Готово!
